#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sean-ahn/iac/runs/run-KBNpzVjQPZ8GS1p3

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.blog-web: Refreshing state... [id=blog-web]
github_repository.iac: Refreshing state... [id=iac]
github_repository.gotzdatacheck: Refreshing state... [id=gotzdatacheck]
tfe_organization.sean-ahn: Refreshing state... [id=sean-ahn]
github_branch_protection.iac_main: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjIwNjkyMTY=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_branch_protection.iac_main has been changed
  ~ resource "github_branch_protection" "iac_main" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjIwNjkyMTY="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.iac_CODEOWNERS will be created
  + resource "github_repository_file" "iac_CODEOWNERS" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = "*       @sean-ahn"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "iac"
      + sha                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @sean-ahn, Action: `pull_request`*